balazsgrill/modembed/res/Devices/dsPIC30/PIC24FV16KA301.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="AD1CHITL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="AD1CHITL" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHH0" edc:desc="" edc:mask="0x1" edc:name="CHH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH1" edc:desc="" edc:mask="0x1" edc:name="CHH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH2" edc:desc="" edc:mask="0x1" edc:name="CHH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH3" edc:desc="" edc:mask="0x1" edc:name="CHH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH4" edc:desc="" edc:mask="0x1" edc:name="CHH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH5" edc:desc="" edc:mask="0x1" edc:name="CHH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH6" edc:desc="" edc:mask="0x1" edc:name="CHH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH7" edc:desc="" edc:mask="0x1" edc:name="CHH7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH8" edc:desc="" edc:mask="0x1" edc:name="CHH8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH9" edc:desc="" edc:mask="0x1" edc:name="CHH9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH10" edc:desc="" edc:mask="0x1" edc:name="CHH10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH11" edc:desc="" edc:mask="0x1" edc:name="CHH11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH12" edc:desc="" edc:mask="0x1" edc:name="CHH12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH13" edc:desc="" edc:mask="0x1" edc:name="CHH13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH14" edc:desc="" edc:mask="0x1" edc:name="CHH14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHH15" edc:desc="" edc:mask="0x1" edc:name="CHH15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn--------" edc:cname="CTMUCON1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000--------" edc:name="CTMUCON1" edc:nzwidth="0x10" edc:por="00000000--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CTTRIG" edc:desc="" edc:mask="0x1" edc:name="CTTRIG" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDISSEN" edc:desc="" edc:mask="0x1" edc:name="IDISSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDGSEQEN" edc:desc="" edc:mask="0x1" edc:name="EDGSEQEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDGEN" edc:desc="" edc:mask="0x1" edc:name="EDGEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TGEN" edc:desc="" edc:mask="0x1" edc:name="TGEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTMUSIDL" edc:desc="" edc:mask="0x1" edc:name="CTMUSIDL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="PFRZ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMUEN" edc:desc="" edc:mask="0x1" edc:name="CTMUEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="CTMU" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnn--" edc:cname="CTMUCON2" edc:desc="" edc:impl="0xfffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000--" edc:name="CTMUCON2" edc:nzwidth="0x10" edc:por="00000000000000--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL" edc:desc="" edc:mask="0xf" edc:name="EDG2SEL" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="EDG2POL" edc:desc="" edc:mask="0x1" edc:name="EDG2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG2EDGE" edc:desc="" edc:mask="0x1" edc:name="EDG2EDGE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDG1" edc:desc="" edc:mask="0x1" edc:name="EDG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDG2" edc:desc="" edc:mask="0x1" edc:name="EDG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL" edc:desc="" edc:mask="0xf" edc:name="EDG1SEL" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="EDG1POL" edc:desc="" edc:mask="0x1" edc:name="EDG1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1EDGE" edc:desc="" edc:mask="0x1" edc:name="EDG1EDGE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL0" edc:desc="" edc:mask="0x1" edc:name="EDG1SEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL1" edc:desc="" edc:mask="0x1" edc:name="EDG1SEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL2" edc:desc="" edc:mask="0x1" edc:name="EDG1SEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL3" edc:desc="" edc:mask="0x1" edc:name="EDG1SEL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL0" edc:desc="" edc:mask="0x1" edc:name="EDG2SEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL1" edc:desc="" edc:mask="0x1" edc:name="EDG2SEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL2" edc:desc="" edc:mask="0x1" edc:name="EDG2SEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL3" edc:desc="" edc:mask="0x1" edc:name="EDG2SEL3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="CTMU" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn--------" edc:cname="CTMUICON" edc:desc="" edc:impl="0xff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000--------" edc:name="CTMUICON" edc:nzwidth="0x10" edc:por="00000000--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="IRNG" edc:desc="" edc:mask="0x3" edc:name="IRNG" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ITRIM" edc:desc="" edc:mask="0x3f" edc:name="ITRIM" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="IRNG0" edc:desc="" edc:mask="0x1" edc:name="IRNG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRNG1" edc:desc="" edc:mask="0x1" edc:name="IRNG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM0" edc:desc="" edc:mask="0x1" edc:name="ITRIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM1" edc:desc="" edc:mask="0x1" edc:name="ITRIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM2" edc:desc="" edc:mask="0x1" edc:name="ITRIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM3" edc:desc="" edc:mask="0x1" edc:name="ITRIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM4" edc:desc="" edc:mask="0x1" edc:name="ITRIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM5" edc:desc="" edc:mask="0x1" edc:name="ITRIM5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnn--------nn" edc:cname="AD1CTMUENH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000--------00" edc:name="AD1CTMUENH" edc:nzwidth="16" edc:por="-00000--------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTMEN16" edc:desc="" edc:mask="0x1" edc:name="CTMEN16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN17" edc:desc="" edc:mask="0x1" edc:name="CTMEN17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN26" edc:desc="" edc:mask="0x1" edc:name="CTMEN26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN27" edc:desc="" edc:mask="0x1" edc:name="CTMEN27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN28" edc:desc="" edc:mask="0x1" edc:name="CTMEN28" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN29" edc:desc="" edc:mask="0x1" edc:name="CTMEN29" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN30" edc:desc="" edc:mask="0x1" edc:name="CTMEN30" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="AD1CTMUENL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="AD1CTMUENL" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTMEN0" edc:desc="" edc:mask="0x1" edc:name="CTMEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN1" edc:desc="" edc:mask="0x1" edc:name="CTMEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN2" edc:desc="" edc:mask="0x1" edc:name="CTMEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN3" edc:desc="" edc:mask="0x1" edc:name="CTMEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN4" edc:desc="" edc:mask="0x1" edc:name="CTMEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN5" edc:desc="" edc:mask="0x1" edc:name="CTMEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN6" edc:desc="" edc:mask="0x1" edc:name="CTMEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN7" edc:desc="" edc:mask="0x1" edc:name="CTMEN7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN8" edc:desc="" edc:mask="0x1" edc:name="CTMEN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN9" edc:desc="" edc:mask="0x1" edc:name="CTMEN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN10" edc:desc="" edc:mask="0x1" edc:name="CTMEN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN11" edc:desc="" edc:mask="0x1" edc:name="CTMEN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN12" edc:desc="" edc:mask="0x1" edc:name="CTMEN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN13" edc:desc="" edc:mask="0x1" edc:name="CTMEN13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN14" edc:desc="" edc:mask="0x1" edc:name="CTMEN14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN15" edc:desc="" edc:mask="0x1" edc:name="CTMEN15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="380"/>
        <edc:SFRDef edc:access="------------nnnn" edc:cname="ANSA" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------1111" edc:name="ANSA" edc:nzwidth="16" edc:por="------------1111">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="ANSELA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA3" edc:desc="" edc:mask="0x1" edc:name="ANSA3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
